src/TaskManager/src/Catalogs/мзМетоды/мзМетоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мзМетоды</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ВидМетода</name>
    <type>
      <types>EnumRef.мзВидыМетодов</types>
    </type>
  </attributes>
  <attributes>
    <name>Алгоритм</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыМетода</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/TaskManager/src/CommonModules/мзЗаданияПовтИсп/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает структуру с описанием параметров метода.
// 
// Параметры:
//  Метод СправочникСсылка.Метод
// 
// Возвращаемое значение:
//  Структура - Описание параметров метода
//	 Ключ - Имя параметра
//	 Значение - Описание типов
Функция ОписаниеПараметровМетода(Метод) Экспорт

	ПараметрыМетода = Новый Структура;

	Если Не ЗначениеЗаполнено(Метод) Тогда
		Возврат ПараметрыМетода;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	мзМетодыПараметрыМетода.ИмяПараметра,
	|	мзМетодыПараметрыМетода.ТипПараметра,
	|	мзМетодыПараметрыМетода.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	Справочник.мзМетоды.ПараметрыМетода КАК мзМетодыПараметрыМетода
	|ГДЕ
	|	мзМетодыПараметрыМетода.Ссылка = &Ссылка
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр("Ссылка", Метод);

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		ПараметрыМетода.Вставить(Выборка.ИмяПараметра, Новый ОписаниеТипов(Выборка.ТипПараметра));
	КонецЦикла;

	Возврат ПараметрыМетода;
	
КонецФункции

#КонецОбласти
